src/cf/Catalogs/РегистрыПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РегистрыПравил</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэш</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>196</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/РегистрыПравил/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Универсальные

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, стрРеквизит)
	Возврат Справочники.РегистрыПравил.ЗначениеРеквизитаОбъекта(Ссылка, стрРеквизит);
КонецФункции

&НаКлиенте
Функция ЭтоИзмерение()
	Возврат ВРег(Объект.Родитель)="ИЗМЕРЕНИЯ";
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Команды

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="АвтоКодАлгоритма" Тогда
		Если ЭтоИзмерение() Тогда
			Объект.ТекстМодуля="ЗначениеИзмерения = СтруктураПараметров.Объект.Дата;";
		Иначе
			Объект.ТекстМодуля="СтруктураПараметров.Отказ = {ЗначениеРесурса};";
		КонецЕсли;
		
	ИначеЕсли Команда.Имя="ВнутреннийИдентификатор" Тогда
		стрИмя=ВнутреннийИдентификатор(Объект.Ссылка);
		Сообщить(стрИмя);
	КонецЕсли;
КонецПроцедуры

Функция ВнутреннийИдентификатор(Ссылка)
	Возврат Справочники.РегистрыПравил.АтрибутВСтроку(Ссылка);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики оповещения

&НаКлиенте
Процедура ОбработкаОповещения_ВыборНаименования(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;
	Если Параметр1.Значение="Пользователь" Тогда
		Объект.ТекстМодуля="ЗначениеИзмерения=ПараметрыСеанса.ТекущийПользователь;";
		ОписаниеТипа=Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		
	ИначеЕсли Параметр1.Значение="ДатаЗапрета" Тогда
		ОписаниеТипа=Новый ОписаниеТипов("Дата");
		Объект.ТекстМодуля="
		|ЗначениеРесурса={ЗначениеРесурса};
		|Если ЗначениеЗаполнено(ЗначениеРесурса) Тогда
		|	СтруктураПараметров.Отказ=КонецДня(СтруктураПараметров.Объект.Дата)<=КонецДня(ЗначениеРесурса);
		|	Если СтруктураПараметров.Событие=""ПриСозданииНаСервере"" Тогда
		|		Если НЕ СтруктураПараметров.Объект.Ссылка.Пустая() Тогда
		|			СтруктураПараметров.Форма.ТолькоПросмотр=СтруктураПараметров.Отказ;
		|		КонецЕсли;
		|		СтруктураПараметров.Отказ=Ложь;
		|	КонецЕсли;
		|	Если СтруктураПараметров.Отказ Тогда
		|		Сообщить(""Доступ закрыт регистром правил!"");
		|	КонецЕсли;
		|КонецЕсли; 
		|";		

	ИначеЕсли Параметр1.Значение="ИсточникДанных" Тогда
		ОписаниеТипа=Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных");
		Объект.ТекстМодуля="ЗначениеИзмерения=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту(""ПолноеИмя"", СтруктураПараметров.Объект.Ссылка.Метаданные().ПолноеИмя());";

	ИначеЕсли Параметр1.Значение="ВозрастДокумента" Тогда
		ОписаниеТипа=Новый ОписаниеТипов("Число");
		Объект.ТекстМодуля="
		|ЗначениеРесурса={ЗначениеРесурса};
		|Если ЗначениеЗаполнено(ЗначениеРесурса) Тогда
		|	СтруктураПараметров.Отказ=КонецДня(СтруктураПараметров.Объект.Дата)<=ТекущаяДата()-(86400*ЗначениеРесурса);
		|	Если СтруктураПараметров.Событие=""ПриСозданииНаСервере"" Тогда
		|		Если НЕ СтруктураПараметров.Объект.Ссылка.Пустая() Тогда
		|			СтруктураПараметров.Форма.ТолькоПросмотр=СтруктураПараметров.Отказ;
		|		КонецЕсли;
		|		СтруктураПараметров.Отказ=Ложь;
		|	КонецЕсли;
		|	Если СтруктураПараметров.Отказ Тогда
		|		Сообщить(""Доступ закрыт регистром правил!"");
		|	КонецЕсли;
		|КонецЕсли;
		|";
	КонецЕсли;

	Объект.Наименование=Параметр1.Представление;
	Объект.Код=СокрЛП(ЗначениеРеквизитаОбъекта(Объект.Родитель, "Родитель.Код"))+"_"+Параметр1.Значение;
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов шапки

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="Наименование" Тогда
		спМеню=Новый СписокЗначений;
		спМеню.Добавить("Пользователь", "Пользователь");
		спМеню.Добавить("ДатаЗапрета", "Дата запрета");
		спМеню.Добавить("ВозрастДокумента", "Возраст документа");
		спМеню.Добавить("ИсточникДанных", "Источник данных");

		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработкаОповещения_ВыборНаименования", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОписаниеОповещения, спМеню, Элементы.Наименование);
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//*** ТолькоПросмотр=Объект.Системный; //Справочники.РегистрыПравил.ЭтоПредопределенныйЭлемент(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаИнфо.Заголовок="Описание "+?(ЭтоИзмерение(), "измерения", "ресурса");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеТипа=ТекущийОбъект.ОписаниеТипа.Получить();
	СписокВыбора=ТекущийОбъект.СписокВыбора.Получить();

	тзБуфер=ТекущийОбъект.ПараметрыВыбора.Получить();
	Если Не тзБуфер=Неопределено Тогда
		Для каждого СтрокаКоллекции Из тзБуфер Цикл
			ЗаполнитьЗначенияСвойств(тзПараметрыВыбора.Добавить(), СтрокаКоллекции);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(ОписаниеТипа) Тогда
		Сообщить("Не указан тип!"); Отказ=Истина; Возврат; 
	КонецЕсли; 
	ТекущийОбъект.ОписаниеТипа=Новый ХранилищеЗначения(ОписаниеТипа);
	ТекущийОбъект.СписокВыбора=Новый ХранилищеЗначения(СписокВыбора);
	ТекущийОбъект.ПараметрыВыбора=Новый ХранилищеЗначения(РеквизитФормыВЗначение("тзПараметрыВыбора"));
КонецПроцедуры
